// var S = prompt('Введите площадь','');
// var R = prompt('Введите радиус','');
// var H = prompt('Введите высоту','');

// var V = (Math.PI*Math.pow(R,2)*H)

// // var TEXT = 'Обьем цилиндра с площадью основы *'+S+'*, радиусом *'+R+'* и высотой *'+H+'* равен:';
// Создайте массив styles с элементами «Джаз», «Блюз».
// Добавьте в конец значение «Рок-н-Ролл»
// Замените предпоследнее значение с конца на «Классика».
// Код замены предпоследнего значения должен работать для
// массивов любой длины.
// Удалите первое значение массива и выведите его alert.
// Добавьте в начало значения «Рэп» и «Регги».
var arr = ["Почему", "надо", "учить", "JavaScript"];

alert( arr.slice(-1) ); // взять все элементы, начиная с номера 1